SetFactory("OpenCASCADE");
//SetFactory("Built-in");
// Создаем исходную точку, линии и плоскую поверхность
Point(1) = {0, 0, 0};
Point(2) = {1, 0, 0};
Point(3) = {1, 1, 0};
Point(4) = {0, 1, 0};

Line(1) = {1, 2};
Line(2) = {2, 3};
Line(3) = {3, 4};
Line(4) = {4, 1};

Curve Loop(1) = {1, 2, 3, 4};
Surface(1) = {1};
//Plane Surface(1) = {1};

// КОМАНДА ПЕРЕМЕЩЕНИЯ ТОЧКИ 3
// Сдвигаем точку 3 на dx=0.5, dy=0.5, dz=0.0
// Плоскость автоматически перестроится по новым координатам
Translate {0.5, 0.5, 0.0} { Point{3}; }
//+
//Point(3) = {1.5, 1.5, 0.0}; 
//+
//Curve Loop(2) = {4, 1, 2, 3};
//+
//Surface(2) = {2};
